/*
---------------------b╧Ь ╧╝а╕--------------------
ф╝╦╝ юз╪уюг ╟Ё╪Ж

╥Гф╝ юж╢б ф╝╦╝╟║ аж╬НаЬ╢ы. ф╝╦╝юг ЁК╣Е╣Ию╨ 1╧Ь╨нем ╧Ьхё╟║ ╨ы╬Н юж╢ы. ╣н ЁК╣Еюг ╧Ьхё╦╕ ╧ч╬ф╪╜ ц╧
╧Ьб╟ ЁК╣Еюг юз╪уюл╦И╪╜ ╣н ╧Ьб╟ ЁК╣Еюг юз╪уюл ╬ф╢я ЁК╣Е╣Июг ╟Ё╪Ж╦╕ ╟Х╩Йго╢б га╥н╠в╥╔ю╩ юш╪╨го╤С.
ф╝╦╝©║╪╜ ЁК╣Еюг юз╪уюл╤У ЁК╣Еюг юз╫д, ╠в юз╫дюг юз╫д, ╠в юз╫дюг юз╫дюг юз╫д, ╣Ню╩ ╦П╣н фВгтго╢б
©К╬Нюл╢ы. ╣н ╧Ьб╟ ЁК╣Е╢б ц╧ ╧Ьб╟ ЁК╣Еюг юз╪уюсюл ╨╦юЕ╣х╢ы.

[ют╥б]
ют╥бю╦╥н╢б ЁК╣Еюг ╟Ё╪Ж и╝╟З аЗ╧╝юг ╟Ё╪Ж и╜юл аж╬НаЬ╢ы. (иу ║б и╝ ║б ижичичиСичичичиС иу ║б и╜ ║б ижичичиСичичич) ╢ыю╫
аы©║ и╝╟Ёюг ЁК╣Е ╧Ьхё╟║ аж╬НаЖ╢б╣╔, аж╬НаЬ ╪Ь╪╜╢К╥н 1╧Ь ЁК╣Е╨нем ╨н╦П ЁК╣Еюг ╧Ьхёюл╢ы. ╥Гф╝ ЁК╣Е
юг ╨н╦П ╧Ьхё╢б 0ю╦╥н аж╬НаЬ╢ы. ╢ыю╫ и╜╟Ёюг аы©║ аЗ╧╝юл ╣н ╟Ёюг ЁК╣Е ╧Ьхё╥н аж╬НаЬ╢ы. ╣н ╧Ьб╟ ЁК╣Е
╢б ц╧ ╧Ьб╟ ЁК╣Еюг юз╪уюсюл ╨╦юЕ╣х╢ы.

[цБ╥б]
╟╒ аЗ╧╝©║ ╢Кгя ╢Дю╩ ╦П╣н ╢Угя ╟╙ю╩ гоЁ╙юг а╓╪Ж╥н цБ╥бгя╢ы.

[ютцБ╥б ©╧]
ют╥б

5 2
2 3 0 3 2
3 2
2 5

цБ╥б
4


ЁК╣Еюг ╪Ж╟║ ╬ф╢о╤С ЁК╣Еюг ╟Ё╪Ж ╤С╪╜ 2+2 = 4╟║ ╣х╢ы.
*/